{
  "reviews": [
    {
      "reviewer": "June B.",
      "rating": "5 star rating",
      "date": "Apr 15, 2025",
      "text": "Delivery on time. Beautiful arrangement and flower selection I love this company! Very nice selection!"
    },
    {
      "reviewer": "Kathleen F.",
      "rating": "4 star rating",
      "date": "May 17, 2025",
      "text": "At first I was angry for poor delivery service, but they made good on it. Customer service is great - delivery service - they have some kinks to work out."
    },
    {
      "reviewer": "Kathleen M.",
      "rating": "2 star rating",
      "date": "May 12, 2025",
      "text": "We ordered mother's day flowers based on the gorgeous pictures on the website. The flowers my mom received looked nothing like them and appeared to have been wilting for days prior. One of the blooms was completely dead. I have no idea why they would think it's okay to deliver in that condition. When I contacted them, they did reply promptly and politely but only offered me redelivery or a 50% refund. I said I would be open to redelivery if they would let me see a picture of the replacement arrangement prior to delivering, but they said that's not possible because \"our customer service team is not in the same area as our dispatch/delivery team.\" That sounds like something Amazon would say, not a local florist. I would venture to guess this silo-ing of parts of the business is partly responsible for the quality issues. Don't be fooled by the website pictures! I understand that they won't have the exact same blooms on hand, but I would expect similar size, quality, and freshness. I've attached what we ordered (\"deluxe\" spring bouquet) on the website and a picture of my poor mom's sad bouquet for comparison."
    },
    {
      "reviewer": "Paige D.",
      "rating": "5 star rating",
      "date": "Aug 17, 2025",
      "text": "Loved getting a bouquet from here. Great selection and value. Nicely wrapped to go in burlap. Friendly service with lots of options for things do to in the studio. You can buy a ticket to do a floral class, you can do a private class, so many options and a fun thing to do with some friends. They also offer subscriptions if you're looking to never forget sending flowers to a loved one."
    },
    {
      "reviewer": "Janet S.",
      "rating": "5 star rating",
      "date": "Sep 16, 2025",
      "text": "Recently I received a flower arrangement from a friend from Flowers for Dreams.   It was beautiful!  The magenta/rust arrangement fit right into the autumn timeframe and brightened up the room.  I would highly recommend this company!"
    },
    {
      "reviewer": "Bailey M.",
      "rating": "3 star rating",
      "date": "Dec 21, 2024",
      "text": "I've always wanted to take one of their workshops here. This fall I signed up for their thanksgiving centerpiece class. It was really fun. They had light snacks and a welcome drink which was cute. I appreciated the variety of flowers they provided for the arrangements. They handed out all of the material in stages which helped make the class less chaotic. Overall, the class went smoothly and was a good size/layout. The instructors were great. The only reason I rated 3/5 was that my arrangement didn't last more than 2 days and I watered it. It was beautiful the day of but a few things I noticed: -some of the flowers I was given already seemed sort of old so I was skeptical before leaving the class how long the arrangement was going to last -for this arrangement and maybe in general they did not use the green foam to hold flowers in place. Instead they used a wire net (maybe more environmentally friendly? I'm not sure.) This didn't work out for me at all. During the class it didn't hold my arrangement structure that we had to redo it halfway through. Then when I got home my flowers weren't at all how I arranged them either. So it left me a little frustrated. Given that, some of the flowers probably didn't get water at times because the wiring kept popping out of the bowl. My arrangement was beautiful and I had fun but for the price it wasn't worth it since it didn't last. It also made me uneasy if I bought flowers how long they'd last. For events or day of flowers, I'd be less concerned and feel confident that they would provide stunning arrangements."
    },
    {
      "reviewer": "Miranda W.",
      "rating": "5 star rating",
      "date": "Jun 9, 2025",
      "text": "My friend had a Sunday birthday this year, and I went on a hunt for a local florist to her (I'm in California) that did Sunday deliveries. Online ordering was super easy and the delivery was seamless. Most importantly, the flowers were beautiful! Thanks!"
    },
    {
      "reviewer": "Emmy B.",
      "rating": "5 star rating",
      "date": "May 31, 2025",
      "text": "Went to flower for dreams open studio and had a blast! Loved all the fresh flowers and helpful staff :)"
    },
    {
      "reviewer": "Lindsay B.",
      "rating": "5 star rating",
      "date": "Aug 21, 2025",
      "text": "We booked flowers for dreams for our wedding and I couldn't be happier!! Easy to work with, arrived on time, and most importantly, they looked amazing!! I couldn't describe what I wanted but they got it to a tee! Beautiful work!"
    },
    {
      "reviewer": "Yvonne I.",
      "rating": "3 star rating",
      "date": "Jan 5, 2025",
      "text": "Review of Floral Arrangement Class: I don't know if it was the time of year, bad luck, or what.... But I was not very impressed with the amount of time my flowers survived from the Thanksgiving centerpiece class I did in November of 2024. The class itself was really fun.  They provided great snacks and beverages to have during the class.  The staff provided excellent instruction and the vibe of the class was perfect. Within less than 2 days, my flowers were already dying.  I had gotten a small $6 bouquet of flowers from Whole Foods on the same day of the class and that bouquet lasted over a week and half before they started going south.  The Flowers for Dreams class is a little over $100 with taxes and fees.  While their class price is similar to some others in the city, the price is a little bit of a splurge for a bouquet that was almost fully dead by Thanksgiving (5 days after the class). I still would be curious to potentially try a wreath class due to the greenery lasting an ok amount of time, but I can't see myself doing a class that involved florals."
    },
    {
      "reviewer": "Jennifer D.",
      "rating": "5 star rating",
      "date": "Jul 28, 2025",
      "text": "We used Flowers for Dreams for multiple wedding events this July, and were so so happy with the result! They constructed ceremony arches, signage florals, tablescapes, cake florals, bouquets, boutonnieres, floral pocket squares, and a hanging candle + greenery installation in our venue skylight. My only piece of constructive criticism is that a year into planning, we were surprised that the original arch we requested during the sales process (which played a large role in vendor selection) wan't possible within the venue layout, and I had to follow up with specific questions and requests for dimensions and mockups to find a solution. As a preferred/repeat vendor of our venue, I would not have expected this to be a last-minute surprise, and after uncovering it, I would have expected more proactive/prescriptive recommendations on the next best options with examples and help visualizing it within the space. I would still rate 5 stars because the team absolutely delivered during our wedding weekend, and everything was even more gorgeous in person than we imagined! Mae let us know the flowers were ours to keep at the end of the evening, so we told guests to use our newspaper programs as build-your-own-bouquet wraps at the end of the night, which was a huge hit. We would definitely recommend Flowers for Dreams to other couples looking for gorgeous florals in Chicago."
    },
    {
      "reviewer": "Julia C.",
      "rating": "5 star rating",
      "date": "Aug 25, 2025",
      "text": "Flowers for Dreams is my go to place for flowers- always! They are such an incredible business and make the most stunning bouquets!"
    },
    {
      "reviewer": "Amanda D.",
      "rating": "5 star rating",
      "date": "Mar 6, 2025",
      "text": "Decided to purchase flowers for our friends last minute. We were indecisive when it came to deciding the bouquet. Ashley took the time to show us not only the display, but the size as well. She made sure we were happy with our selection before purchasing! Great experience from beginning to end"
    },
    {
      "reviewer": "Laura Y.",
      "rating": "1 star rating",
      "date": "Mar 5, 2025",
      "text": "Just terrible. Sent my mom flowers for her birthday and the arrangement came in and were NOT anything like how they were pictured. I paid extra for a medium bouquet, and they were absolutely TINY. Literally the size of my birthday card to her. I paid $95 for this. I expressed my concern and she admitted that the pics on the website weren't accurate bc they put all the flowers in the bouquet \"up\" and \"front facing\" and nowhere do they disclose how small the actual arrangement is. What a rip off. Then they only offered 20% off refund (which only covered the delivery fee) and I had to beg for more of a refund bc of how horrible they were and only got a 40% refund aka $37. DO NOT buy from here. You can get better arrangements from pro flowers. I attached pics of what I got vs what I ordered"
    },
    {
      "reviewer": "Thomas O.",
      "rating": "1 star rating",
      "date": "May 20, 2025",
      "text": "I've been a subscription customer, but sadly I've been disappointed two deliveries in a row. Most recently, I received a bouquet of tulips that were clearly immature: green, limp, and depressing to look at. They looked more like underdeveloped buds than anything resembling a vibrant arrangement. I reached out to customer service, and while the response was polite, I was essentially told that these were \"premium tulips\" and just needed some care. I've bought tulips regularly for years and know the difference between flowers that need a trim and those that simply weren't ready to be harvested. Being told that drooping, closed green buds are a premium experience felt dismissive and frustrating. After pushing back, I had to insist multiple times for my subscription to be canceled and am still waiting on a refund. Very disappointed in the quality and the way the issue was handled. I hope others have a better experience, but this was my last order."
    },
    {
      "reviewer": "Dina E.",
      "rating": "2 star rating",
      "date": "Sep 19, 2023",
      "text": "Disappointed my beautiful bouquet was left by the doormat on the ground.  I was given a window of 8a-5p for delivery, waited home all day and finally left at 4:40 for 10 minutes.  I returned home at 4:50 and found the flowers lying  on the ground ready for the bunnies to dine on. I was surprised the flowers were not simply placed on the bench adjacent to the front door.  Also, I was surprised the flowers were not in a box, or were not covered in any way. The person who sent the flowers went out of their way to send this special gift and sadly, there was not much care given with the delivery."
    },
    {
      "reviewer": "Pamela B.",
      "rating": "1 star rating",
      "date": "May 16, 2025",
      "text": "The flowers were dead when they arrived and I sent a picture and they never responded.  It was very disheartening"
    },
    {
      "reviewer": "Sharon T.",
      "rating": "5 star rating",
      "date": "May 15, 2025",
      "text": "Mother's Day surprise from my daughter. I loved them!  It was like they were just picked from a field and arranged in a mason jar. The flowers perked right up from the shipment and look beautifu!"
    },
    {
      "reviewer": "Carolyn L.",
      "rating": "5 star rating",
      "date": "Nov 19, 2024",
      "text": "I use Flowers For Dreams all the time when I'm sending someone flowers locally in Chicago, but was inspired to leave a review after the incredible job they just did on our wedding. The florals were all stunning from the tablescape to my bouquet. Knowing that some of $$ goes to good causes is such a bonus too!!"
    },
    {
      "reviewer": "Lisa J.",
      "rating": "5 star rating",
      "date": "May 12, 2025",
      "text": "The flower bouquet I received for Mother's Day was incredibly beautiful and I was thrilled to know that a portion of the proceeds would go to a charity. The gift blessed me and others- perfect!"
    }
  ]
}